# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\chemi\UD3_QCW\UD3_QFN.cydsn\UD3_QFN.cyprj
# Date: Tue, 13 Jan 2026 23:59:16 GMT
#set_units -time ns
create_clock -name {CyBUS_CLK(routed)} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_bus}]]
create_clock -name {CyPWMCLK(routed)} -period 31.25 -waveform {0 15.625} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {Cysamp_clk(routed)} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/dclk_1}]]
create_clock -name {CyINTCLK(routed)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/dclk_2}]]
create_clock -name {ADC_therm_Ext_CP_Clk(routed)} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/dclk_4}]]
create_clock -name {Clock_18(routed)} -period 125000 -waveform {0 62500} [list [get_pins {ClockBlock/dclk_5}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {CyPWMCLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 3 5} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {Cysamp_clk} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2001 4001} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_generated_clock -name {CyINTCLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 65 129} [list [get_pins {ClockBlock/dclk_glb_2}]]
create_generated_clock -name {UART_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 9} [list [get_pins {ClockBlock/dclk_glb_3}]]
create_clock -name {ADC_therm_Ext_CP_Clk} -period 15.625 -waveform {0 7.8125} [list [get_pins {ClockBlock/dclk_glb_4}]]
create_generated_clock -name {ADC_therm_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 35 69} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_generated_clock -name {ADC_peak_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} [list [get_pins {ClockBlock/aclk_glb_1}]]
create_generated_clock -name {ADC_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 37 73} [list [get_pins {ClockBlock/aclk_glb_2}]]
create_generated_clock -name {Clock_18} -source [get_pins {ClockBlock/clk_sync}] -edges {1 8001 16001} [list [get_pins {ClockBlock/dclk_glb_5}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\chemi\UD3_QCW\UD3_QFN.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\chemi\UD3_QCW\UD3_QFN.cydsn\UD3_QFN.cyprj
# Date: Tue, 13 Jan 2026 23:59:00 GMT
